//package Lesson2.Shapes;
//
///*
//2.6 Вам нужно написать программу содержащую три класса Triangle, Circle, Square,
//а так же класс Group, который будет содержать любое количество фигур включая другие группы.
//Так же нужно написать несколько классов,
//которые будут выполнять сериализацию дерева фигур в формат XML и JSON.
//*/
//
//
//import java.util.ArrayList;
//import java.util.List;
//
//public class FigureSize {
//   private List<Circle> figures = new ArrayList<Circle>();
////   public Figures(){}
//
//    public List getFigures() {
//        System.out.println(figures);
//        return figures;
//    }
//
//    public void setFigures(ArrayList figures) {
//        this.figures = figures;
//    }
//
//    public void addFigure(Circle circle) {
//        figures.add(circle);
//    }
//
//    @Override
//    public String toString() {
//
//
//       return figures + " ";
//    }
//}
